default rel
extern atoi
extern strcpy
%include "logger.inc"

section .bss
    key_prefix resb 256                ; Буфер для хранения ключа при парсинге объекта

section .data
start_parser:
    db "Starting JSON parser", 0
is_success:
    db "JSON parsed successfully", 0
is_invalid:
    db "invalid json", 0
prefix:
    db "------------------------------------------", 0

section .text
global jsonParse
; (rdi: укзатель на json строку, rsi: указатель на структуру для результата)

; id элементов json: 1 - объект, 2 - массив, 3 - строка | 4 - число, 5 - булевое значение, 6 - null
; Формат записи в буфере:
; [count: 2 байта][запись1][запись2]...
; Запись: [type: 1 байт][key_len: 2 байта][key: key_len байт][val_len: 2 байта][val: val_len байт]

jsonParse:
    LOG_JSON start_parser
    push rbx
    push rcx
    push rdx
    push r8
    push r9
    push r15

    mov rbx, rdi                       ; сохраняем указатель на json строку в rbx
    mov rcx, rsi                       ; сохраняем указатель на структуру для результата в rcx
    mov word [rcx], 0                  ; инициализируем счетчик пар ключ-значение в структуре для результата нулем
    lea r15, [rcx + 2]                 ; сохраняем указатель на массив для объектов/массивов в r15
    xor r8, r8                         ; r8 будет использоваться как индекс для прохода по строке
    xor r9, r9                         ; r9 будет использоваться для хранения типа текущего элемента (число, строка, объект и т.д.)

; Пропускаем возможные пробелы в самом начале файла
    call .skip_ws_loop

; Если сразу конец строки - это ошибка
    cmp byte [rbx + r8], 0
    je .invalid_json

; Вызываем чтение одного (корневого) значения
    call .parse_value

; После парсинга всего документа идем на выход
    jmp .done

.skip_ws_loop:
    call .is_ws
    cmp rax, 1
    jne .skip_ws_done                  ; Если не пробел - выходим из цикла
    inc r8
    jmp .skip_ws_loop

.skip_ws_done:
    ret

.parse_value:
    call .is_object_or_array_or_string
    mov rdx, rax

    cmp rdx, 0
    je .is_number_or_bool_or_null

    cmp rdx, 1
    je .parse_object

    cmp rdx, 2
    je .parse_array

    cmp rdx, 3
    je .parse_string

    jmp .invalid_json
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
; Блок проверки на пустой симвл
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
.is_ws:
    cmp byte [rbx+ r8], 0x20           ; проверяем на пробел
    je .ws_find

    cmp byte [rbx+ r8], 0x09           ; проверяем на табуляцию
    je .ws_find

    cmp byte [rbx+ r8], 0x0A           ; проверяем на новую строку
    je .ws_find

    cmp byte [rbx+ r8], 0x0D           ; проверяем на возврат каретки
    je .ws_find

    mov rax, 0
    ret

.ws_find:
    mov rax, 1
    ret

; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
; Блок проверки на объект, массив или строку
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

.is_object_or_array_or_string:
    cmp byte [rbx + r8], 0x7B          ; '{'
    je .is_object

    cmp byte [rbx + r8], 0x5B          ; '['
    je .is_array

    cmp byte [rbx + r8], 0x22          ; '"'
    je .is_string

    mov rax, 0
    ret

.is_object:
    mov rax, 1
    ret

.is_array:
    mov rax, 2
    ret

.is_string:
    mov rax, 3
    ret

; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
; Блок проверки на число, булевое значение или null
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

.is_number_or_bool_or_null:
    call .is_number
    cmp rax, 1
    je .parse_number

    call .is_bool_or_null
    mov rdx, rax

    cmp rdx, 1
    je .parse_true

    cmp rdx, 2
    je .parse_false

    cmp rdx, 3
    je .parse_null

    jmp .invalid_json
    ret

; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
; Блок проверки на число
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

.is_number:
    mov al, byte [rbx + r8]

    cmp al, 0x2D                       ; '-'
    je .make_negative_number

    jmp .is_real_number

.is_not_number:
    mov rax, 0
    ret

.make_negative_number:
    mov al, byte [rbx + r8 + 1]
    jmp .is_real_number

.is_real_number:

    cmp al, 0x30                       ; '0'
    jb .is_not_number

    cmp al, 0x39                       ; '9'
    ja .is_not_number

    mov rax, 1
    ret
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
; Блок проверки на булевое значение или null
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

.is_bool_or_null:
    mov eax, dword [rbx + r8]

; Проверяем на 'null' ("llun")
    cmp eax, 0x6C6C756E
    je .is_null

; Проверяем на 'true' ("eurt")
    cmp eax, 0x65757274
    je .is_true

; Для 'false' проверяем первые 4 байта 'fals' ("slaf" = 0x736C6166)
    cmp eax, 0x736C6166
    jne .is_not_bool_or_null

; Если первые 4 байта совпали, проверяем 5-й байт 'e' (0x65)
    cmp byte [rbx + r8 + 4], 0x65
    je .is_false

    jmp .is_not_bool_or_null

.is_not_bool_or_null:
    mov rax, 0
    ret

.is_true:
    mov rax, 1
    ret

.is_false:
    mov rax, 2
    ret

.is_null:
    mov rax, 3
    ret

; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
; Парсер объекта/массива/строки
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
.parse_object:
    push r10
    push r11
    push r12
    push r14
    inc r8
    xor rsi, rsi                       ; счетчик пар ключ-значение в объекте

    call .skip_ws_loop

    lea rax, [rbx + r8]                ; сохраняем указатель на начало объекта в rax

    cmp byte [rbx + r8], 0x7D          ; "Проверяем на закрывающую фигурную скобку '}'"
    je .parse_object_end
.parse_object_loop:
    cmp byte [rbx + r8], 0x22          ; "
    jne .invalid_json

    call .parse_string                 ; парсим ключ объекта (строка)

    mov r10, rax                       ; сохраняем указатель на ключ в r10
    mov r11, rdx                       ; сохраняем длину ключа в r11

    call .skip_ws_loop

    cmp byte [rbx + r8], 0x3A          ; ":"
    jne .parse_object_error
    inc r8
    inc rsi                            ; увеличиваем счетчик пар ключ-значение в объекте
    call .skip_ws_loop

    call .parse_value                  ; парсим значение объекта (может быть любым типом)

    mov r12, rax                       ; сохраняем указатель на значение в r12
    mov r14, rdx

    mov byte [r15], r9b                ; сохраняем тип значения (число, строка, объект и т.д.) в структуру для результата
    inc r15

    mov word [r15], r11w               ; сохраняем длину ключа в структуру для результата
    add r15, 2

    mov rdi, r15                       ; сохраняем указатель на ключ в структуру для результата
    mov rsi, r10                       ; сохраняем указатель на значение в структуру для результата
    call strcpy

    add r15, r11                       ; сдвигаем указатель на структуру для результата на длину ключа

    mov word [r15], r14w               ; сохраняем длину значения в структуру для результата
    add r15, 2

    mov rdi, r15                       ; сохраняем указатель на значение в структуру для результата
    mov rsi, r12                       ; сохраняем указатель на значение в структуру для результата
    call strcpy

    add r15, r14                       ; сдвигаем указатель на структуру для результата на длину значения

    inc word [rcx]                     ; увеличиваем счетчик пар ключ-значение в структуре для результата

    call .skip_ws_loop
    mov al, byte [rbx + r8]
    cmp al, 0x2C                       ; ","
    je .parse_object_next_item

    cmp al, 0x7D                       ; "}"
    je .parse_object_end

    jmp .parse_object_error

.parse_object_next_item:
    inc r8
    inc rsi
    call .skip_ws_loop
    jmp .parse_object_loop             ; переходим к следующей паре ключ-значение

.parse_object_end:
    mov rdx, rsi                       ; сохраняем количество пар ключ-значение в rdx
    mov r9, 1
    pop r14
    pop r12
    pop r11
    pop r10
    inc r8
    ret

.parse_object_error:
    pop r14
    pop r12
    pop r11
    pop r10
    jmp .invalid_json
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
.parse_array:
    xor rsi, rsi
    inc r8                             ; пропускаем начальную скобку
    call .skip_ws_loop

    lea rax, [rbx + r8]                ; сохраняем указатель на начало массива в rax
    cmp byte [rbx + r8], 0x5D          ; "]"
    je .parse_array_end

.parse_array_loop:
    call .parse_value
    call .skip_ws_loop
    mov al, byte [rbx + r8]
    cmp al, 0x2C
    je .parse_array_next_item

    cmp al, 0x5D
    je .parse_array_end

    jmp .invalid_json
.parse_array_next_item:
    inc r8
    inc rsi
    call .skip_ws_loop
    jmp .parse_array_loop
.parse_array_end:
    inc r8
    mov rdx, rsi                       ; сохраняем количество элементов в массиве в rdx
    mov r9, 2
    ret
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

; () -> (rax = указатель на строку, rdx = длина строки)
.parse_string:
    xor rdx, rdx
    inc r8                             ; пропускаем начальную кавычку
    lea rax, [rbx + r8]                ; сохраняем указатель на начало строки в rax
.parse_string_loop:
    cmp byte [rbx + r8], 0x5C          ; проверяем на экранирование '\'
    je .escape_char

    cmp byte [rbx + r8], 0x22          ; проверяем на закрывающую кавычку '"'
    je .string_end

    inc r8
    inc rdx
    jmp .parse_string_loop

.escape_char:
    add r8, 2                          ; пропускаем символ после '\'
    add rdx, 2                         ; увеличиваем счетчик на 2 символа
    jmp .parse_string_loop
.string_end:
    mov r9, 3
    inc r8
    ret
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
; Парсер чисел/булевых значений/null
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

.parse_number:
    push r12
    push r13
    push r14
    lea rax, [rbx + r8]
    mov r12, rax
    mov r13, r8
    lea rdi, [rbx + r8]

    call atoi

    mov r8, rdi
    sub r8, rbx

    mov rax, r12
    mov r14, r8

    sub r14, r13

    mov rdx, r14
    mov r9, 4

    pop r14
    pop r13
    pop r12
    ret
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

.parse_true:
    lea rax, [rbx + r8]
    add r8, 4

    mov rdx, 4
    mov r9, 5
    ret
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

.parse_false:
    lea rax, [rbx + r8]
    add r8, 5

    mov rdx, 5
    mov r9, 5
    ret
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

.parse_null:
    lea rax, [rbx + r8]
    add r8, 4

    mov rdx, 4
    mov r9, 6
    ret
; -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

.invalid_json:
    LOG_ERROR is_invalid
    ret

.done:
    LOG_JSON is_success
    pop r15
    pop r9
    pop r8
    pop rdx
    pop rcx
    pop rbx
    ret
